#include "iostream"
using namespace std;

int main() {
    int a, b;
    a = 7;
    b = 19;

    // a) На променлива c с плаваща запетая присвоете резултата от делението на a и b. Изведете резултата.
    float c = a / b;
    cout <<  c << endl;
    // Резултата е от тип integer, защото при делението на еднакъв тип данни резултата е от същия тип

    //б) На променлива d с плаваща запетая присвоете резултата от делението на a и b, като конвертирате a във float.
    // Изведете резултата.
    float d = (float) a / b;
    cout << "b)" << d << endl;
    // Резултата е от тип float, защото при делението на различни типове данни (float с int) тогава
    // то приема типа float.

    system("pause");
    return 0;
}